{
  "id": "operating-reserve",
  "title": "Operating Reserve",
  "description": "Capability above firm system demand required for regulation, load forecasting error, and outages.",
  "language": "en",
  "tags": ["reserve", "operation", "regulation", "nerc", "system-operator", "nyiso"],
  "related": [],
  "version": "1.0.0",
  "breaking": false,
  "dates": {
    "created": "2025-03-15",
    "last_modified": "2025-06-22"
  },
  "authors": [
    {
      "name": "Jinning Wang",
      "url": "https://jinningwang.github.io"
    }
  ],
  "content": {
    "sections": [
      {
        "order": 1,
        "id": "definition-by-nerc",
        "title": "Definition by NERC",
        "type": "definition",
        "source_keys": ["nerc2024glossary"],
        "page": null,
        "body_md": "> That capability above firm system demand required to provide for regulation, load forecasting error, equipment forced and scheduled outages and local area protection.\n> It consists of spinning and non-spinning reserve.\n",
        "figures": [
          {
            "path": "/assets/img/pswiki/operating_reserve.png",
            "caption_md": "        Operating Reserves (from <d-cite key=\"nerc2021reserve\"></d-cite>)",
            "zoomable": true,
            "source_keys": ["nerc2021reserve"]
          }
        ]
      },
      {
        "order": 2,
        "id": "definition-by-nyiso",
        "title": "Definition by NYISO",
        "type": "definition",
        "source_keys": ["nyiso2025ancillary"],
        "page": "p41, Version 9.0",
        "body_md": "> Operating Reserve service provides backup generation and/or demand response in the event that the NYISO experiences a real-time power system Contingency requiring emergency corrective action. In order for the New York Control Area (NYCA) to respond in a timely fashion, the reserves must be available from qualified Resources located within the NYCA and within specific regions, as required by the NYSRC and other applicable reliability standards.\n\n> Types of Operating Reserves\n>\n> - **10-Minute Spinning Reserve**: Operating Reserves provided by qualified Resources located within the NYCA that are already synchronized to the NYS Power System and can respond to instructions from the NYISO to change output level within 10 minutes. Spinning reserve may not be provided by Behind-the-Meter Net Generation Resources that are comprised of more than one generating unit that are dispatched as a single aggregate unit.\n> - **10-Minute Non-Synchronized Reserve** (10-Minute NSR): Operating Reserves provided by Resources that can be started, synchronized, and loaded within 10 minutes. Operating Reserves may also be provided by Demand Side Resources where the demand response is provided by a Local Generator or by Behind-the-Meter Net Generation Resources that are comprised of more than one generating unit that are dispatched as an aggregate unit.\n> - **30-Minute Spinning Reserve**: Operating Reserves provided by qualified Resources except Behind-the-Meter Net Generation Resources that are comprised of more than one generating unit and dispatched as a single aggregate unit located within the NYCA that are already synchronized to the NYS Power System and can respond to instructions from the NYISO to change output level within 30 minutes.\n> - **30-Minute Non-Synchronized Reserve** (30-Minute NSR): Operating reserves that can be provided by Resources, Behind-the-Meter Net Generation Resources that are comprised of more than one generating unit that are dispatched as an aggregate unit, that can be started, synchronized, and loaded within 30 minutes. Operating Reserves may also be provided by Demand Side Resources where the demand response is provided by a Local Generator.\n> - **Total 10-Minute Reserve**: The sum of the 10-Minute Spinning Reserve and 10-Minute NSR. [NERC defines this as “contingency reserve”]\n> - **Total 30-Minute Reserve**: The sum of the 30-minute Spinning Reserve and 30-Minute NSR provided by Generators and Demand Side Resources that respond to instructions to change output or provide a demand reduction within 30 minutes.\n> - **Total Operating Reserve**: The sum of the total 10-minute reserve and the total 30-minute reserve. [The [NERC definition of operating reserve](/wiki/operating-reserve) includes regulation]\n"
      }
    ]
  }
}
