{
  "id": "stability",
  "title": "Stability",
  "description": "The ability to maintain equilibrium during normal and abnormal conditions.",
  "language": "en",
  "tags": ["stability", "nerc", "ieee", "ieee-task-force", "cigre", "article"],
  "related": ["security", "reliability"],
  "version": "1.0.0",
  "breaking": false,
  "dates": {
    "created": "2025-03-15",
    "last_modified": "2025-11-01"
  },
  "authors": [
    {
      "name": "Jinning Wang",
      "url": "https://jinningwang.github.io"
    }
  ],
  "content": {
    "sections": [
      {
        "order": 1,
        "id": "revised-definition-in-an-article-by-a-task-force",
        "title": "Revised Definition in an Article by a Task Force",
        "type": "note",
        "source_keys": ["hatziargyriou2021stability"],
        "page": null,
        "body_md": "<br>\n\n\n> Stability is the ability of an electric power system, for a given initial operating condition, to regain a state of operating equilibrium after being subjected to a physical disturbance, with most system variables bounded so that practically the entire system remains intact.\n",
        "figures": [
          {
            "path": "/assets/img/pswiki/power-system-time-scales.png",
            "caption_md": "        Fig. 1. Power system times scales. (from <d-cite key=\"hatziargyriou2020stabilityreport\"></d-cite>)",
            "zoomable": true,
            "source_keys": ["hatziargyriou2020stabilityreport"]
          },
          {
            "path": "/assets/img/pswiki/classification-of-power-system-stability.png",
            "caption_md": "        Fig. 4. Classification of power system stability (from <d-cite key=\"hatziargyriou2020stabilityreport\"></d-cite>)",
            "zoomable": true,
            "source_keys": ["hatziargyriou2020stabilityreport"]
          }
        ]
      },
      {
        "order": 2,
        "id": "definition-by-nerc",
        "title": "Definition by NERC",
        "type": "definition",
        "source_keys": ["nerc2024glossary"],
        "page": null,
        "body_md": "> The ability of an electric system to maintain a state of equilibrium during normal and abnormal conditions or disturbances.\n"
      },
      {
        "order": 3,
        "id": "definition-in-an-article-by-a-joint-task-force-of-ieee-and-cigre",
        "title": "Definition in an Article by a Joint Task Force of IEEE and CIGRE",
        "type": "definition",
        "source_keys": ["kundur2004stability"],
        "page": null,
        "body_md": "> Stability of a power system refers to the continuance of intact operation following a disturbance. It depends on the operating condition and the nature of the physical disturbance.\n"
      },
      {
        "order": 4,
        "id": "elaboration-in-an-article-by-a-joint-task-force-of-ieee-and-cigre",
        "title": "Elaboration in an Article by a Joint Task Force of IEEE and CIGRE",
        "type": "definition",
        "source_keys": ["kundur2004stability"],
        "page": null,
        "body_md": "> Relationships between Reliability, Security, and Stability\n>\n> 1. Reliability is the overall objective in power system design and operation. To be **reliable**, the power system must be **secure** most of the time. To be **secure**, the system must be **stable** but must also be secure against other contingencies that would not be classified as stability problems e.g., damage to equipment such as an explosive failure of a cable, fall of transmission towers due to ice loading or sabotage. As well, a system may be stable following a contingency, yet insecure due to post-fault system conditions resulting in equipment overloads or voltage violations.\n> 2. System security may be further distinguished from stability in terms of the **resulting consequences**. For example, two systems may both be stable with equal stability margins, but one may be relatively more secure because the consequences of instability are less severe.\n> 3. Security and stability are time-varying attributes which can be judged by studying the performance of the power system under a particular set of conditions. Reliability, on the other hand, is a function of the time-average performance of the power system &nbsp; it can only be judged by consideration of the system’s behavior over an appreciable period of time.\n"
      }
    ]
  }
}
