{
  "id": "subregions",
  "title": "Subregions",
  "description": "Geographic concepts for emission data by EPA.",
  "language": "en",
  "tags": ["geography", "epa"],
  "related": ["zone", "region", "control-area", "balancing-authority-area", "reliability-coordinator-area"],
  "version": "1.0.0",
  "breaking": false,
  "dates": {
    "created": "2025-03-15",
    "last_modified": "2025-06-20"
  },
  "authors": [
    {
      "name": "Jinning Wang",
      "url": "https://jinningwang.github.io"
    }
  ],
  "content": {
    "sections": [
      {
        "order": 1,
        "id": "definition-by-epa",
        "title": "Definition by EPA",
        "type": "definition",
        "source_keys": ["epa2024gridregions"],
        "page": null,
        "body_md": "> For U.S. grid regions’ emission data, EPA provides recent and historic air emissions, including carbon dioxide (CO2), for U.S. portions of grid regions, States, and Puerto Rico.\n\n> EPA’s **Emissions & Generation Resource Integrated Database** (eGRID) is the preeminent source of air emission data for the U.S. electric power sector. eGRID is based on available data for all U.S. electricity generating plants that provide power to the electric grid and report data to the U.S. government.\n\n> eGRID is valuable to users seeking air emission data about the electric power sector in the United States. eGRID is typically used for greenhouse gas registries and inventories, carbon footprints, consumer information disclosure, emission inventories and standards, power market changes, and avoided emission estimate eGRID data are cited by many emission inventory and registry protocols, various emission calculation tools and applications, hundreds of academic papers, and consultants; it is used for many research applications and efforts.\n\n> eGRID annually updates its emission data and rates for each of its subregions. It also provides aggregated data by state, U.S. total, and by sets of electric grid boundaries, including NERC regions and eGRID subregions.\n",
        "figures": [
          {
            "path": "/assets/img/pswiki/egrid_subregions_map.png",
            "caption_md": "        Map of eGRID Subregions (from <d-cite key=\"epa2024gridregions\"></d-cite>)",
            "zoomable": true,
            "source_keys": ["epa2024gridregions"]
          }
        ]
      }
    ]
  }
}
